{
  "backend/main.mo": "Defines data models and state for products, updates, contacts, user profiles, logo, and both admin and customer authentication with session management and OTP flows.",
  "feature_evidence.json": "Lists implemented features with associated files, components, and test IDs for admin password login, customer OTP login, and routing updates.",
  "frontend-file-summaries.txt": "Provides short summaries of multiple frontend files, describing UI pages, components, and hooks used across the app.",
  "frontend/docs/custom-domain.md": "Documentation describing how to configure a custom domain for the Beemedha Internet Computer deployment.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining typography, themes, color variables, and utility background classes.",
  "frontend/index.html": "HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures hash-based routing and admin-protected routes using AdminRouteGuard, with pages for public and admin sections.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "React guard component that checks admin session validity and redirects to the login page if unauthorized.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Route guard that checks Internet Identity and owner status, showing login or access denied screens before rendering children.",
  "frontend/src/components/auth/CustomerLoginDialog.tsx": "Modal for customer login using email or phone OTP, with request, verification, and logout flows.",
  "frontend/src/components/auth/LoginButton.tsx": "Button handling Internet Identity login/logout with status awareness and query cache clearing.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable styled layout primitives including Section, Container, and branded Card, Badge, and Button wrappers.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, quick links, and a newsletter signup form.",
  "frontend/src/components/layout/Header.tsx": "Header with navigation, logo loading, customer login dialog toggling, and admin session controls.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout composing header, footer, main outlet, and global toaster with background pattern.",
  "frontend/src/components/news/NewsCard.tsx": "Card displaying a product update summary with type badge, date, title, and preview text.",
  "frontend/src/components/products/PriceDisplay.tsx": "Price display component showing formatted price, optional original price, and discount badge.",
  "frontend/src/components/products/ProductCard.tsx": "Renders a product card with image, availability badge, description, and price, supporting category fallback images and variant pricing.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Shows a disabled Add to Cart button and alert indicating online checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Provides UI controls to select weight or flavor variants and notifies parent of price changes.",
  "frontend/src/config/owner.ts": "Defines the owner principal and a helper to check if a principal matches it.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity and triggers refetch on identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin login sessions, validating stored sessions and providing login/logout helpers.",
  "frontend/src/hooks/useCustomerSession.ts": "Handles customer sessions with OTP flow, session validation, and logout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, loading/storing identities and providing login and clear actions.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns default polling and refetch settings for live updates.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description when pages load.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating products and related data via the backend actor.",
  "frontend/src/index.css": "Imports global stylesheet from parent index.css.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the brand's story, ethical beekeeping, and purity commitments using images and styled components.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Admin page for adding and removing admin principals using Internet Identity with validation and toast feedback.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Main admin hub showing links to manage products, news, logo, and settings with owner detection.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Login form handling username/password authentication with error display and redirects.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Page to view, upload, preview, and update the site logo with file validation.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Interface to create and delete product-related news updates, with dialogs and product selection.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Full CRUD interface for products including variants, filtering, search, and stock management.",
  "frontend/src/pages/CertificationsPage.tsx": "Displays certification and quality assurance information, including a quality seal, lab testing details, and related visuals.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission handling, plus contact info and feedback alerts.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero banner, navigation buttons, and trust highlight cards for natural, pure, and lab‑tested honey.",
  "frontend/src/pages/NewsDetailPage.tsx": "Fetches and displays details for a specific news update, including date, type badge, message, and related product info with navigation controls.",
  "frontend/src/pages/NewsPage.tsx": "Displays filterable product updates using tabs, fetching updates by type and showing the latest sorted entries with a last-updated timestamp.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections outlining data collection, usage, sharing, and security practices.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info, variant selection, pricing, availability, and related updates based on the product ID.",
  "frontend/src/pages/ProductsPage.tsx": "Lists all products with category-based filtering via tabs, showing loading states and timestamps for fetched data.",
  "frontend/src/pages/TermsPage.tsx": "Displays the site's terms and conditions, covering website use, product information, orders, and other policies.",
  "frontend/src/utils/assets.ts": "Encodes only the filename portion of asset paths to ensure special characters render correctly in image URLs.",
  "frontend/src/utils/logo.ts": "Converts backend logo byte data into object URLs and provides a helper to revoke them.",
  "frontend/src/utils/price.ts": "Provides helpers for INR price formatting, discount detection, percentage calculation, and display struct construction.",
  "frontend/src/utils/principal.ts": "Validates and parses Dfinity principal strings and offers a formatter for truncated display.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Describes the project's current state, including admin and customer auth feature requirements and architectural notes."
}