{
  "backend/main.mo": "Defines product, update, contact, and user role types plus storage maps, and implements admin/user access control with profile and admin‑management functions.",
  "backend/migration.mo": "Implements a minimal migration that preserves the access control state and returns it unchanged.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for documentation or build reference.",
  "frontend/docs/custom-domain.md": "Guide explaining how to configure DNS and boundary node settings to use a custom domain with the Beemedha IC deployment.",
  "frontend/index.css": "Defines global Tailwind CSS base styles, color variables, typography rules, and honeycomb background utilities.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up all application routes using TanStack Router, including admin‑protected routes wrapped by AdminRouteGuard.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Checks Internet Identity authentication and admin status, showing login, loading, or access‑denied screens before rendering protected content.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Route guard that restricts access to the contract owner, showing login or denial messages if unauthorized.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with error handling and query cache reset.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Shared UI primitives for sections, containers, cards, badges, and buttons with brand styling.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, navigation, and a newsletter subscription form.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation links, admin access check, login button, and responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Root layout combining header, footer, content outlet, background pattern, and global toaster.",
  "frontend/src/components/news/NewsCard.tsx": "Card displaying a product update with type badge, date, preview text, and link to full update.",
  "frontend/src/components/products/PriceDisplay.tsx": "Displays product pricing with optional discount, original price, and size-based styling.",
  "frontend/src/components/products/ProductCard.tsx": "Card showing product image, availability, description, price, and variant count with link to details.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Placeholder UI showing disabled purchase button and alert for upcoming checkout.",
  "frontend/src/components/products/VariantSelector.tsx": "Selector for weight or flavor variants that updates selected price and variant label.",
  "frontend/src/config/owner.ts": "Defines the owner principal and helper to check admin ownership.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React provider and hook for managing Internet Identity authentication, including login state, stored identity loading, and client creation.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Provides default polling and refetch settings for React Query hooks.",
  "frontend/src/hooks/usePageMeta.ts": "Updates the document title and meta description based on page content.",
  "frontend/src/hooks/useQueries.ts": "Defines numerous React Query hooks for fetching and mutating products, categories, contact forms, and related backend data using an actor and live-update settings.",
  "frontend/src/index.css": "Re-exports the root stylesheet by importing the parent index.css file.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with hero, story, and ethical beekeeping sections, setting page metadata.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Provides UI to add or remove admin principals with validation, mutation calls, and clipboard copy functionality.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Shows the admin dashboard with navigation cards for managing products, news, logo, and settings.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Allows admins to upload and update the site logo with file validation, preview handling, and backend upload.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Admin page for listing, creating, and deleting product news updates, with a dialog form and type‑based badges.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for creating, editing, filtering, and deleting products, including variant management and search/filter UI.",
  "frontend/src/pages/CertificationsPage.tsx": "Displays certification, quality assurance, and lab testing information with accompanying visuals and metadata.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with submission handling, validation, feedback alerts, and page metadata.",
  "frontend/src/pages/HomePage.tsx": "A landing page with a hero section, promotional messaging, and highlight cards encouraging users to shop for honey products.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays details for a specific product update, including metadata, message content, date, and related product info.",
  "frontend/src/pages/NewsPage.tsx": "Shows a tabbed list of product updates filtered by update type, sorted by timestamp, with loading and empty states.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections covering data collection, use, sharing, and security.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information, variant selection, pricing, availability, related updates, and navigation back to products.",
  "frontend/src/pages/ProductsPage.tsx": "Displays product listings with category tabs, fetching products via queries and showing loading, empty, or grid states.",
  "frontend/src/pages/TermsPage.tsx": "Renders the site's terms and conditions with structured sections and page metadata.",
  "frontend/src/utils/assets.ts": "Utility that normalizes asset URLs by encoding only the filename portion to ensure images load correctly.",
  "frontend/src/utils/logo.ts": "Converts backend logo binary data into browser object URLs and provides a helper to revoke them.",
  "frontend/src/utils/price.ts": "Helpers for formatting INR prices, determining discounts, and producing display‑ready price data.",
  "frontend/src/utils/principal.ts": "Validates and formats Dfinity principals, blocking anonymous principals and offering truncation for display.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using both query strings and hash routing plus sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing admin‑access issues, requirements, and current state for enabling specified principals as admins."
}