{
  "backend/main.mo": "Main canister implementing access control, user profiles, and full product CRUD with variants, stock, updates, and contact submissions.",
  "backend/migration.mo": "Migration module converting old product records to the new schema by selecting a single image and adding stock and deletion flags.",
  "feature_evidence.json": "Feature evidence report mapping feature requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Collected summaries of multiple frontend files describing their roles in routing, UI, and product/news management.",
  "frontend/docs/custom-domain.md": "Documentation explaining how to configure custom domains for the Beemedha Internet Computer deployment.",
  "frontend/index.css": "Global stylesheet importing fonts, defining Tailwind layers, and setting theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML document loading the React app entrypoint.",
  "frontend/src/App.tsx": "Main routing setup using TanStack Router with hash history, including guarded admin and owner dashboard routes.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that requires Internet Identity login and admin permissions before rendering children, showing status or denial alerts otherwise.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with error handling and React Query cache clearing.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable brand‑styled layout primitives including Section, Container, Card, Badge, and Button wrappers.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, quick links, a newsletter form with validation, and dynamic year.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation links, admin link when authorized, mobile menu, logo, and login button.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top‑level site layout composing header, footer, main outlet, background pattern, and global toaster.",
  "frontend/src/components/news/NewsCard.tsx": "Card displaying a product update with type badge, date, title preview, and link to full news entry.",
  "frontend/src/components/products/PriceDisplay.tsx": "Price display component showing current price, optional original price, and discount percentage.",
  "frontend/src/components/products/ProductCard.tsx": "Product card with image, price, availability badge, variant count, and link to product details.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Disabled add‑to‑cart button with alert indicating checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Selector for weight or flavor variants that updates selected price and label on change.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context for Internet Identity authentication, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns default react‑query live update settings including refetch interval and focus behavior.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description based on provided page metadata.",
  "frontend/src/hooks/useQueries.ts": "Defines product, contact form, and other backend data queries and mutations using the actor and react‑query.",
  "frontend/src/index.css": "Re-exports the parent index.css file.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with brand story, ethical beekeeping info, and associated visuals.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard providing links to manage products and news, with a notice about admin access. Uses brand cards for navigation.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Allows admins to create, list, and delete product news updates with a dialog form and product selection. Sorts updates by timestamp and displays badges by update type.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Full admin interface for creating, editing, searching, filtering, and deleting products, including handling variants and pricing. Uses dialogs and tables for product management.",
  "frontend/src/pages/CertificationsPage.tsx": "Displays certifications, lab testing details, and quality assurance information for the brand.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form page with validation, submission via backend mutation, and success/error alerts.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, navigation buttons, and trust highlights promoting natural honey.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays details for a single news update, including type badge, date, message, and related product info.",
  "frontend/src/pages/NewsPage.tsx": "Lists product update news with tab filters for update types and shows sorted updates with last-updated info.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows the site's privacy policy with structured sections on data collection, use, and security.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including images, pricing, availability, variants, and related updates.",
  "frontend/src/pages/ProductsPage.tsx": "Displays products with category filtering using tabs and fetches data via product queries. Renders product cards and shows last updated time.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with structured sections and metadata. Content includes agreement terms, usage rules, and policy details.",
  "frontend/src/utils/assets.ts": "Normalizes asset URLs by encoding filenames to ensure correct rendering of images with special characters.",
  "frontend/src/utils/price.ts": "Provides INR price formatting, discount detection, display price logic, and helpers for rendering price information.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and removing parameters from hash-based URLs.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, color tokens, fonts, animations, and plugin setup.",
  "project_state.json": "Project metadata describing current features, architecture notes, and requirements for an e‑commerce site with an admin dashboard."
}