{
  "backend/main.mo": "Defines the backend actor with product, order, customer, session, and store settings types plus state maps and authorization/storage mixins.",
  "feature_evidence.json": "Lists feature evidence entries documenting admin UI routing fixes and diagnostic safeguards with affected files and components.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for many frontend files, focusing on admin, product, and layout functionality.",
  "frontend/.redeploy-trigger": "Marker file used to force a rebuild and deployment without code changes.",
  "frontend/docs/custom-domain.md": "Documentation explaining how to configure DNS and register a custom domain for the deployed frontend canister.",
  "frontend/docs/rebuild-redeploy.md": "Guide describing how to trigger a fresh rebuild and redeployment of the application.",
  "frontend/index.css": "Global stylesheet defining theme variables, typography, animations, and Tailwind layers.",
  "frontend/index.html": "Base HTML entrypoint loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up React Router and Query Client, defines public and admin routes, and wraps the app with theme and query providers.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Deprecated wrapper component that simply renders children and no longer performs auth checks.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that validates the admin session and redirects unauthenticated users using safeNavigate.",
  "frontend/src/components/admin/dashboard/AdminShell.tsx": "Layout wrapper providing sidebar navigation, mobile menu, and logout handling for admin dashboard sections.",
  "frontend/src/components/admin/dashboard/sections/CustomersSection.tsx": "Displays a table of customers with name, contact details, order count, and total spent, with loading skeletons.",
  "frontend/src/components/admin/dashboard/sections/DashboardSection.tsx": "Shows store overview stats, low‑stock alerts, and recent data using dashboard metrics with navigation support.",
  "frontend/src/components/admin/dashboard/sections/OrdersSection.tsx": "Manages order list display, viewing details, and updating order statuses with dialogs and loading states.",
  "frontend/src/components/admin/dashboard/sections/ProductsSection.tsx": "Handles product listing, creation, editing, and deletion with form dialogs, image validation, and CRUD actions.",
  "frontend/src/components/admin/dashboard/sections/StoreSettingsSection.tsx": "Provides a form to update store contact info and branding images with validation and update handling.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/auth/CustomerLoginDialog.tsx": "Customer login modal handling email-based login, address management, and order display.",
  "frontend/src/components/auth/LoginButton.tsx": "Button toggling Internet Identity login/logout with loading states.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Shared UI primitives for sections, containers, cards, badges, and buttons with brand styling.",
  "frontend/src/components/brand/GlobalNeonBackground.tsx": "Disabled component returning null for unused neon background.",
  "frontend/src/components/brand/NeonSurface.tsx": "Wrapper that simply returns children without neon effects.",
  "frontend/src/components/cart/CartSheet.tsx": "Slide-in cart panel showing items, quantities, pricing, and checkout trigger.",
  "frontend/src/components/common/DrawerCloseButton.tsx": "Small reusable close button for drawers using an icon.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, newsletter form, and dynamic settings.",
  "frontend/src/components/layout/Header.tsx": "Site header with logo, navigation, account access, and cart interactions.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper that includes the header unless on admin routes.",
  "frontend/src/components/news/NewsCard.tsx": "Card displaying a product update with type badge, date, and preview text.",
  "frontend/src/components/orders/DeliveryAddressForm.tsx": "Form component for entering and validating delivery address fields before submitting to a parent callback.",
  "frontend/src/components/orders/PlaceOrderDialog.tsx": "Modal workflow for selecting or adding an address and placing an order, handling authentication and cart submission.",
  "frontend/src/components/products/PriceDisplay.tsx": "Displays formatted product pricing with discount and size options using utility formatting.",
  "frontend/src/components/products/ProductCard.tsx": "Product preview card showing image, price, availability badge, and navigation to product details.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Disabled purchase UI placeholder indicating checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Selector UI for weight or flavor variants that triggers price and variant updates.",
  "frontend/src/config/owner.ts": "Defines and checks the owner principal used for admin access control.",
  "frontend/src/hooks/useActor.ts": "Hook for creating and caching the backend actor tied to the user's identity with automatic query invalidation.",
  "frontend/src/hooks/useAdminCustomers.ts": "Builds a customer list with aggregated order counts and totals from admin order data.",
  "frontend/src/hooks/useAdminDashboardData.ts": "Aggregates admin dashboard metrics including product counts, low stock items, recent orders, and customer totals.",
  "frontend/src/hooks/useAdminOrders.ts": "Manages fetching and updating admin orders with live updates and status mutation handling.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides admin product CRUD mutations with image upload handling and query invalidation.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session state with localStorage, simulated login, and session validation.",
  "frontend/src/hooks/useAdminStoreSettings.ts": "Fetches and updates store settings, handles image uploads, and syncs parsed contact/social data.",
  "frontend/src/hooks/useCart.ts": "Manages shopping cart state with localStorage persistence, item operations, and totals.",
  "frontend/src/hooks/useCustomerAddresses.ts": "Loads, saves, and deletes customer delivery addresses tied to the active session.",
  "frontend/src/hooks/useCustomerOrders.ts": "Fetches customer orders with session-based querying and optional live updates.",
  "frontend/src/hooks/useCustomerSession.ts": "Handles customer login, logout, and session persistence with simulated authentication.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login flow, identity loading, and state management.",
  "frontend/src/hooks/useIsAdminRoute.ts": "Detects if the current pathname begins with /admin.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns default refetch settings for live-updating queries.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description based on provided values.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating products, updates, and user profiles via the actor API.",
  "frontend/src/hooks/useStoreSettings.ts": "Fetches store settings with caching and exposes loading and error states.",
  "frontend/src/index.css": "Imports global stylesheet from parent directory.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Empty page component placeholder.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Empty placeholder admin access page.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard root that switches between dashboard sections inside an admin shell.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login form handling authentication, redirects, and validation states.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Empty placeholder admin logo page.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Empty placeholder admin news page.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Empty placeholder admin orders page.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Empty placeholder admin products page.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Empty placeholder admin site settings page.",
  "frontend/src/pages/CertificationsPage.tsx": "Empty page component placeholder.",
  "frontend/src/pages/ContactPage.tsx": "Empty page component placeholder.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero section, trust highlights, and navigation to products.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays details for a single news update, including product info and metadata.",
  "frontend/src/pages/NewsPage.tsx": "Lists news updates with filtering by type and auto-refresh indicators.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy page with structured sections and metadata.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that loads a product, manages variant/quantity selection, and allows adding items to the cart.",
  "frontend/src/pages/ProductsPage.tsx": "Lists products with category tabs, loading states, and last-updated info using product query hooks.",
  "frontend/src/pages/TermsPage.tsx": "Static terms and conditions page with structured sections and page metadata.",
  "frontend/src/utils/assets.ts": "Encodes filenames in asset URLs to avoid issues with spaces and special characters.",
  "frontend/src/utils/externalBlob.ts": "Provides helpers to convert files to bytes and simulate external blob uploads with progress.",
  "frontend/src/utils/jpeg.ts": "Validates JPEG files and reads them as bytes via FileReader.",
  "frontend/src/utils/logo.ts": "Empty placeholder logo utility file.",
  "frontend/src/utils/price.ts": "Helpers for INR price formatting, discount detection, and price display data.",
  "frontend/src/utils/principal.ts": "Validates and formats Dfinity principals, including parsing and display truncation.",
  "frontend/src/utils/safeNavigate.ts": "Provides a debounced navigation helper that avoids repeated or rapid navigations to the same path and logs warnings when blocked.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL params, persist them in sessionStorage, and clean them from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Tracks project metadata, known issues, and feature requirements related to admin dashboard flicker fixes."
}