{
  "backend/main.mo": "Motoko canister implementing access-controlled user profiles, product CRUD, updates, and contact submissions using maps and authorization mixins.",
  "feature_evidence.json": "JSON report listing feature implementations, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Lookup file providing short predefined summaries for various frontend admin and page components.",
  "frontend/index.css": "Tailwind-based global theme file defining Beemedha color palette, fonts, dark mode tokens, and utility classes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Defines the application's routing structure, pages, and admin-protected routes using TanStack Router.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks authentication and admin permissions, gating admin routes with alerts and login prompts.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout states and query cache clearing.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable UI primitives for sections, containers, cards, badges, and buttons styled to match the brand theme.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with branding, navigation links, social icons, and a newsletter signup form with toast feedback.",
  "frontend/src/components/layout/Header.tsx": "Implements the responsive site header with navigation links, admin access, mobile menu, and CTA buttons.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout including a decorative background, header, routed content area, footer, and global toaster.",
  "frontend/src/components/news/NewsCard.tsx": "Displays a product update card with type badge, date, title, and preview text linking to the full news item.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product card with image, name, description, price, and availability badge linking to the product page.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Provides a disabled purchase button and alert indicating checkout is not yet available.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, stored identity handling, and context access.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns polling settings for live data refetching.",
  "frontend/src/hooks/usePageMeta.ts": "Updates the document title and description meta tag based on the page's metadata.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating products, product updates, and contact form submissions using the actor API.",
  "frontend/src/index.css": "Imports the root index.css stylesheet.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the brand's story, values, and ethical beekeeping practices.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays the admin dashboard with navigation cards for managing products and news, plus an admin access notice.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Provides an interface to list, create, and delete product-related news updates with dialog-based forms.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Implements product management including listing, creating, editing, and deleting products via a modal form.",
  "frontend/src/pages/CertificationsPage.tsx": "Displays certification, quality assurance, and lab testing information with supporting images and sections.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission via mutation, plus static contact details.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section, navigation buttons, and highlight cards promoting product qualities.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays a detailed view of a single product update, including its date, message, type badge, and related product info.",
  "frontend/src/pages/NewsPage.tsx": "Shows a tabbed list of product updates filtered by update type with sorting and last-updated info.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections covering data collection, usage, sharing, and security.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows full product details, images, availability, price, and related product updates with loading and not-found states.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a tabbed product catalog allowing filtering by category with real-time update timestamps.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with static sections and headings using brand layout components.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash parsing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and container settings for the frontend.",
  "project_state.json": "Defines overall project state for building a premium Beemedha website, including goals, architecture notes, image requirements, and existing feature implementations. Contains planning details for UI theme, navigation, pages, and future e‑commerce readiness."
}