{
  "backend/main.mo": "Defines the canister’s product, update, contact, user, and logo types with access control, single-admin enforcement, and APIs for managing profiles, products, updates, contacts, and admin queries.",
  "backend/migration.mo": "Provides a migration function that maps old actor state to the new actor format by removing deprecated admin fields while preserving data.",
  "feature_evidence.json": "Feature evidence report linking the single-admin UI update to its affected frontend file and related components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files, describing their purpose and functionality across the app and admin interface.",
  "frontend/docs/custom-domain.md": "Documentation explaining how to configure DNS and connect a custom domain to the deployed Internet Computer canister.",
  "frontend/index.css": "Global Tailwind/CSS file defining fonts, color variables, themes, and utility classes such as honeycomb backgrounds.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the router with all public and admin routes, enforcing admin and owner-only guards for protected pages.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks Internet Identity authentication and admin permissions, showing login or access-denied UI when needed.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Route guard that checks Internet Identity auth and owner status, showing login or access-denied UI before rendering children for the owner.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with handling for auth state, errors, and react-query cache clearing.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable brand-styled layout primitives including Section, Container, Card, Badge, and Button wrappers.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, quick links, and a newsletter form with validation and toast feedback.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with navigation, custom logo loading, admin link handling, login button, and mobile menu toggle.",
  "frontend/src/components/layout/SiteLayout.tsx": "Top-level layout rendering header, footer, routed content, and global toaster over a background pattern.",
  "frontend/src/components/news/NewsCard.tsx": "Card showing a product update with type badge, date, title, and preview text, linking to the update detail page.",
  "frontend/src/components/products/PriceDisplay.tsx": "Displays formatted pricing with optional discount, original price, and size-based styling.",
  "frontend/src/components/products/ProductCard.tsx": "Product listing card showing image, name, availability, description, and price, linking to the product detail page.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Disabled add-to-cart button with alert indicating checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Renders weight or flavor variant selection UI and notifies parent on selection changes, initializing with the first variant.",
  "frontend/src/config/owner.ts": "Defines the owner principal string and provides a helper to check if a given principal matches it.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and exposing identity state to the app.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns shared react-query settings for periodic refetching and window-focus updates.",
  "frontend/src/hooks/usePageMeta.ts": "Updates document title and meta description based on provided page metadata.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating products and related backend resources using the actor.",
  "frontend/src/index.css": "Re-imports the root index.css file for global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with story, beekeeping philosophy, and brand imagery, setting appropriate page metadata.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Provides single‑admin access info, lists admin principals, and supports copying principal IDs.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard linking to product, news, and logo management sections with identity‑based owner check.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Admin page for uploading and validating a site logo with preview, file checks, and update mutation.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Admin interface to create, list, sort, and delete product news updates with dialogs and product selection.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Full admin dashboard for creating, editing, filtering, and deleting products with variant management and dialogs.",
  "frontend/src/pages/CertificationsPage.tsx": "Renders certifications and quality-assurance information with images and sections, setting page metadata.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, mutation-based submission, and success/error alerts.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero section and product highlights with navigation to the products page.",
  "frontend/src/pages/NewsDetailPage.tsx": "Shows detailed information for a single news update, including metadata, message, date, and related product info.",
  "frontend/src/pages/NewsPage.tsx": "Lists news updates with tab filtering by update type and displays sorted update cards.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy content with sections outlining data collection and usage.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info, variant selection, availability, and related updates using product queries and navigation.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a category‑filterable product list with tabs, loading states, and last‑updated timestamps.",
  "frontend/src/pages/TermsPage.tsx": "Renders the site's terms and conditions with structured sections and page metadata.",
  "frontend/src/utils/assets.ts": "Utility to encode filenames in asset URLs while preserving path segments.",
  "frontend/src/utils/logo.ts": "Converts logo byte data to object URLs and safely revokes them to free resources.",
  "frontend/src/utils/price.ts": "Helpers for INR price formatting, discount calculations, and structured price display data.",
  "frontend/src/utils/principal.ts": "Validates and formats Dfinity principals, preventing anonymous principals and allowing truncated display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Defines project metadata, current features, and pending requests for enforcing single-admin mode tied to a specific Internet Identity principal."
}