{
  "backend/main.mo": "Defines core backend types and state for products, updates, contacts, users, orders, sessions, and site settings, with initial maps and counters.",
  "feature_evidence.json": "Contains a feature evidence report listing removed Internet Identity admin auth and the affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend files including admin pages, components, utilities, and hooks.",
  "frontend/.redeploy-trigger": "Trigger file indicating a forced rebuild and redeploy request with metadata.",
  "frontend/docs/custom-domain.md": "Documentation describing how to configure a custom domain for the Beemedha app on the Internet Computer.",
  "frontend/docs/rebuild-redeploy.md": "Guide explaining how to perform a fresh rebuild and redeploy without functional changes.",
  "frontend/index.css": "Global Tailwind and theme CSS defining color tokens, fonts, dark mode, and honeycomb background utilities.",
  "frontend/index.html": "Base HTML template that loads the React app entrypoint.",
  "frontend/src/App.tsx": "Main React app router setup with public and admin routes, guarded by AdminRouteGuard, using TanStack Router and React Query.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component that checks admin session validity and redirects to login if invalid, rendering children only when authenticated.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Empty placeholder file for an owner-only route guard.",
  "frontend/src/components/auth/CustomerLoginDialog.tsx": "Customer login and session dialog supporting email/phone login, profile display, delivery address, and order history.",
  "frontend/src/components/auth/LoginButton.tsx": "A login/logout button using Internet Identity with error handling and dynamic UI states.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable styled layout components like sections, containers, cards, badges, and buttons.",
  "frontend/src/components/layout/Footer.tsx": "Site footer with branding, social links, navigation links, and a newsletter signup form.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation, customer login handling, and mobile menu support.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with header and footer for public routes and minimal layout for admin routes.",
  "frontend/src/components/news/NewsCard.tsx": "Card displaying a product update with type badge, date, title, and message preview.",
  "frontend/src/components/orders/DeliveryAddressForm.tsx": "Form for creating or editing a delivery address with validation and optional action buttons.",
  "frontend/src/components/orders/PlaceOrderDialog.tsx": "Dialog for saving an address and placing an order with success and error handling.",
  "frontend/src/components/products/PriceDisplay.tsx": "Price display component showing formatted price, original price, and discount info.",
  "frontend/src/components/products/ProductCard.tsx": "Displays a product card with image, availability, description, price, and variant count, linking to the product details page.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Shows a disabled Add to Cart button and an alert indicating checkout is coming soon.",
  "frontend/src/components/products/VariantSelector.tsx": "Renders a selector for weight or flavor variants and notifies parent on variant changes with price and label.",
  "frontend/src/config/owner.ts": "Defines the owner principal and provides a helper to check if a given principal matches it.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminSession.ts": "Handles admin session login, validation, persistence, and logout using the backend actor.",
  "frontend/src/hooks/useCustomerSession.ts": "Manages customer sessions with validation, login, logout, and stored customer info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth state.",
  "frontend/src/hooks/useIsAdminRoute.ts": "Checks if the current route path starts with /admin.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns config for periodic data refetching and focus-based updates.",
  "frontend/src/hooks/usePageMeta.ts": "Sets the document title and meta description based on provided values.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating product, settings, and contact data via the backend actor.",
  "frontend/src/index.css": "Re-exports the root CSS file by importing ../index.css.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider and renders App.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About page using site settings content with fallback text and branded layout components.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Empty file with no implementation provided.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays an admin dashboard with navigation cards for managing products, news, logo, settings, and orders.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Provides an admin login form with validation, session handling, and redirects upon successful authentication.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Allows admins to view the current logo and upload a new one with validation and preview support.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Enables creating, listing, and deleting product news updates linked to specific products.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows a table of customer orders with status updates and detailed order view capabilities.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin UI for listing, filtering, creating, editing, and deleting products with variant handling and stock management.",
  "frontend/src/pages/admin/AdminSiteSettingsPage.tsx": "Admin form for loading, editing, and saving site-wide settings such as images, content, and contact details.",
  "frontend/src/pages/CertificationsPage.tsx": "Renders certifications content and optional image sourced from site settings with styled info cards.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation and submission plus contact info loaded from site settings.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero section, navigation buttons, and highlight cards promoting honey quality.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays a detailed view of a single news update with metadata, related product info, and navigation handling.",
  "frontend/src/pages/NewsPage.tsx": "Shows a list of product updates with tab-based filtering, sorting, and last-updated timestamps.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections for data collection, usage, and security.",
  "frontend/src/pages/ProductDetailPage.tsx": "Presents detailed product information, variant selection, availability, related updates, and ordering options.",
  "frontend/src/pages/ProductsPage.tsx": "Lists products with category-based filtering, tab navigation, and update timestamps.",
  "frontend/src/pages/TermsPage.tsx": "Renders the Terms & Conditions page with sections on agreement, website use, product info, orders, and shipping.",
  "frontend/src/utils/assets.ts": "Encodes the filename portion of asset URLs to ensure images load correctly.",
  "frontend/src/utils/logo.ts": "Converts backend logo binary data into a browser object URL and provides a safe cleanup helper.",
  "frontend/src/utils/price.ts": "Utility functions for formatting INR prices, detecting discounts, and preparing display pricing data.",
  "frontend/src/utils/principal.ts": "Validates and formats Dfinity principal strings with error handling and truncation helpers.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Metadata describing the project state, feature requests, and architectural direction regarding admin authentication changes."
}