{
  "backend/main.mo": "Motoko canister defining product catalog, updates, contacts, user profiles, admin management with strict owner-only admin control, and role-based access checks.",
  "feature_evidence.json": "Feature evidence report documenting files and components involved in enforcing owner‑only access for the /admin/access route.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their functionality and purpose in the application.",
  "frontend/docs/custom-domain.md": "Guide explaining how to configure DNS and boundary node settings to use a custom domain with the deployed app.",
  "frontend/index.css": "Global Tailwind and CSS variables setup defining theme colors, fonts, and utility classes like honeycomb backgrounds.",
  "frontend/index.html": "Base HTML file containing the root div and script entry point for the frontend application.",
  "frontend/src/App.tsx": "Main router configuration wiring all site and admin routes, using AdminRouteGuard and OwnerOnlyRouteGuard for protected sections.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that checks Internet Identity login and admin status, showing login prompts or access‑denied UI when required.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Route guard that checks Internet Identity authentication and owner status, showing login or access‑denied screens before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with automatic query cache clearing and retry logic if already authenticated.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Reusable styled primitives for sections, containers, cards, badges, and buttons with consistent brand styling.",
  "frontend/src/components/layout/Footer.tsx": "Footer with brand info, social links, navigation links, and a newsletter signup form with toast feedback.",
  "frontend/src/components/layout/Header.tsx": "Header with logo, navigation links, admin link, mobile menu, shop button, and login control using dynamic logo loading.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper providing header, footer, main outlet, background pattern, and global toaster.",
  "frontend/src/components/news/NewsCard.tsx": "Displays a product update card with type badge, date, title, and preview text linking to the update detail page.",
  "frontend/src/components/products/PriceDisplay.tsx": "Shows formatted price with optional original price and discount percentage in variable size styles.",
  "frontend/src/components/products/ProductCard.tsx": "Product card showing image, availability, description, price, and variant count, linking to product details.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Disabled Add‑to‑Cart button with an alert indicating that online checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Renders weight or flavor variant buttons, tracks selected index, and notifies parent of price and label changes.",
  "frontend/src/config/owner.ts": "Defines the owner principal and a helper to verify if a given principal matches it.",
  "frontend/src/hooks/useActor.ts": "Initializes an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity context, login/logout handling, and loads or creates an AuthClient for Internet Identity.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns standard polling and refetch settings for live updates.",
  "frontend/src/hooks/usePageMeta.ts": "Sets document title and meta description on page load with a special case for the owner dashboard.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend product and admin API calls in React Query hooks for fetching and mutating data.",
  "frontend/src/index.css": "Re-imports the root CSS file.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Displays the About Us page with brand story, ethical beekeeping info, and page meta setup.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Provides admin management tools to list, add, and remove admin principals with validation and UI feedback.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Displays the admin dashboard with navigation cards for managing products, news, and site content.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Admin page for uploading, validating, previewing, and updating the site logo with mutation hooks and file handling.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Admin interface to create, list, sort, and delete product news updates with dialogs and form handling.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin dashboard for creating, editing, filtering, and deleting products with variant support and dialog forms.",
  "frontend/src/pages/CertificationsPage.tsx": "Shows certification, quality assurance, and lab testing details with supporting visuals and meta tags.",
  "frontend/src/pages/ContactPage.tsx": "Implements a contact form with validation, submission via mutation, and success or error alerts. Also renders contact page layout with form fields and messaging UI.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage hero, navigation buttons, and highlight cards showcasing product trust features. Uses page metadata and navigation hooks.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays details for a specific news update, including metadata, date, message, and related product info. Handles loading, missing updates, and type badges.",
  "frontend/src/pages/NewsPage.tsx": "Shows a tabbed list of product updates filtered by type, with sorting, loading states, and last-updated info. Fetches and displays update cards for each category.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the privacy policy page with structured sections describing data collection, usage, sharing, and security. Includes page metadata and styled layout.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product information, handles variant selection, and fetches product data and updates using query hooks.",
  "frontend/src/pages/ProductsPage.tsx": "Shows a categorized product listing with tabs, fetching products by category and updating the view accordingly.",
  "frontend/src/pages/TermsPage.tsx": "Renders the site's terms and conditions with static sections and page metadata setup.",
  "frontend/src/utils/assets.ts": "Utility to normalize asset URLs by encoding only the filename segment.",
  "frontend/src/utils/logo.ts": "Helpers to convert backend logo data into object URLs and revoke them to free memory.",
  "frontend/src/utils/price.ts": "Price formatting and discount utilities plus helpers to compute display and original prices.",
  "frontend/src/utils/principal.ts": "Validates and formats Dfinity Principals, preventing anonymous admins and providing truncated display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining dark mode, content paths, extended theme options, custom colors, fonts, animations, and plugins.",
  "project_state.json": "Stores project state, including feature requirements for enforcing self-only admin access via a specific Internet Identity principal."
}