{
  "backend/main.mo": "Motoko canister defining product catalog types, access control with admin roles, and CRUD-like state for products, updates, contacts, profiles, and logo.",
  "feature_evidence.json": "Empty feature evidence report containing metadata scaffold.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files describing pages, components, hooks, and utilities.",
  "frontend/docs/custom-domain.md": "Guide detailing how to configure a custom domain for the Beemedha IC deployment with DNS and boundary node setup steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining fonts, themes, colors, utilities, and honeycomb background assets.",
  "frontend/index.html": "Base HTML entry point loading the frontend app via main.tsx.",
  "frontend/src/App.tsx": "Main router configuration using TanStack Router with public and admin routes wrapped in AdminRouteGuard.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Component gating admin routes by checking Internet Identity authentication and admin status with login and denial flows.",
  "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx": "Route guard restricting access to the contract owner principal, showing login or access-denied screens as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides a login/logout button using Internet Identity, handling authentication state and query cache reset.",
  "frontend/src/components/brand/BrandPrimitives.tsx": "Defines styled layout primitives such as Section, Container, BrandCard, BrandBadge, and BrandButton.",
  "frontend/src/components/layout/Footer.tsx": "Renders the site footer with brand info, navigation links, social icons, and a mock newsletter signup form.",
  "frontend/src/components/layout/Header.tsx": "Displays the site header with logo, navigation, admin link, login button, and responsive mobile menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, outlet content, background pattern, and toaster notifications.",
  "frontend/src/components/news/NewsCard.tsx": "Shows a clickable news/update card with badge, date, title, and message preview.",
  "frontend/src/components/products/PriceDisplay.tsx": "Displays product pricing with discount, original price, and size-based styling.",
  "frontend/src/components/products/ProductCard.tsx": "Renders a product card with image, availability badge, description, and price from variants or base price.",
  "frontend/src/components/products/PurchasePlaceholder.tsx": "Shows a disabled purchase button and alert indicating checkout is not yet available.",
  "frontend/src/components/products/VariantSelector.tsx": "Allows selecting weight or flavor variants and notifies the parent of the selected variant and price.",
  "frontend/src/config/owner.ts": "Defines the owner principal and a helper to check if a given principal matches it.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on authentication state, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an authentication context and provider using Dfinity AuthClient, exposing identity state, login, logout, and status helpers.",
  "frontend/src/hooks/useLiveUpdateConfig.ts": "Returns default refetch settings for live-updating React Query hooks.",
  "frontend/src/hooks/usePageMeta.ts": "Sets the document title and meta description when a page loads or updates.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating products and related backend data using an ICP actor.",
  "frontend/src/index.css": "Imports global stylesheet from the parent directory.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the Beemedha About page with story, values, and sustainability info using branded components.",
  "frontend/src/pages/admin/AdminAccessPage.tsx": "Allows admins to add or remove administrator principals with validation and clipboard copy support.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides a dashboard linking to admin sections for managing products, news, and site assets.",
  "frontend/src/pages/admin/AdminLogoPage.tsx": "Enables uploading, previewing, validating, and updating the site logo via backend mutations.",
  "frontend/src/pages/admin/AdminNewsPage.tsx": "Page for listing, creating, and deleting product news updates with a dialog form and update-type badges.",
  "frontend/src/pages/admin/AdminProductsPage.tsx": "Admin interface for searching, filtering, creating, editing, seeding, and deleting products with variant support.",
  "frontend/src/pages/CertificationsPage.tsx": "Displays certifications, lab testing details, and quality assurance information for Beemedha.",
  "frontend/src/pages/ContactPage.tsx": "Provides a contact form with validation and submission handling plus company contact details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, navigation buttons, and trust highlights promoting natural honey.",
  "frontend/src/pages/NewsDetailPage.tsx": "Displays details for a specific news update, including metadata, message content, date, and related product info.",
  "frontend/src/pages/NewsPage.tsx": "Shows a tabbed list of product updates filtered by type, sorted by timestamp with loading and empty states.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Presents the site's privacy policy with sections outlining data collection, usage, sharing, and security.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information with images, pricing, variant selection, availability badges, and related updates.",
  "frontend/src/pages/ProductsPage.tsx": "Displays products with category tabs, loading states, and last-updated info using multiple product queries.",
  "frontend/src/pages/TermsPage.tsx": "Renders the site's terms and conditions with sectioned content and page metadata.",
  "frontend/src/utils/assets.ts": "Utility to normalize asset URLs by encoding only the filename segment.",
  "frontend/src/utils/logo.ts": "Converts backend logo binary data to a browser URL and provides a safe revocation helper.",
  "frontend/src/utils/price.ts": "Helpers for formatting INR prices, detecting discounts, and computing display pricing details.",
  "frontend/src/utils/principal.ts": "Validates, parses, and formats Dfinity principals with error handling and truncation support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state and pending feature requests for multi-admin support and safe upgrades."
}