{
  "kind": "build_request",
  "title": "Add Thejas principal (ekphf-6psww-...) as an admin",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Internet Identity principal \"ekphf-6psww-nfwx5-qaowa-goqyc-hgqqa-4m57p-3xfjb-kb73d-joktd-sqe\" is granted the admin role (multi-admin) so they can access all admin-only routes and APIs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "ekphf-6psww-nfwx5-qaowa-goqyc-hgqqa-4m57p-3xfjb-kb73d-joktd-sqe",
          "add this as an admin for Thejas",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "After deployment/upgrade, calling the backend 'isCallerAdmin' (used by the frontend admin route guard) returns true for caller principal ekphf-6psww-nfwx5-qaowa-goqyc-hgqqa-4m57p-3xfjb-kb73d-joktd-sqe.",
        "When logged in with Internet Identity as that principal, the user can access all /admin routes without seeing the 'Access Denied' screen.",
        "The change does not remove or weaken existing access control checks for admin-only backend APIs (e.g., create/update/delete products, product updates, contacts, logo update)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a safe, conditional upgrade path so existing deployed canister state gains the admin role for \"ekphf-6psww-nfwx5-qaowa-goqyc-hgqqa-4m57p-3xfjb-kb73d-joktd-sqe\" without losing existing data (products, updates, contacts, profiles, logo) and without breaking current admins.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "build it",
          "add this as an admin for Thejas"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading a canister that already has data preserves all existing state (products, updates, contacts, profiles, logo).",
        "If the principal ekphf-6psww-nfwx5-qaowa-goqyc-hgqqa-4m57p-3xfjb-kb73d-joktd-sqe is already an admin, the upgrade is idempotent (no errors; role remains admin).",
        "If the principal is not yet an admin, it becomes an admin after upgrade (verified via the same admin-check query used by the frontend)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or other frontend immutable paths defined in SYSTEM_CONTEXT.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Building a UI to map principals to human names (e.g., displaying 'Thejas' in-app).",
    "Adding third-party authentication providers beyond Internet Identity.",
    "Adding real-time notifications or messaging around admin changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}