{
  "kind": "build_request",
  "title": "Make provided principal the sole admin (single-admin mode)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Grant admin privileges to the Internet Identity principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\" and ensure it remains the only administrator (single-admin mode).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2",
          "msg-3"
        ],
        "quotes": [
          "make me as a admin",
          "should me be the only admin for now",
          "zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe"
        ]
      },
      "acceptanceCriteria": [
        "After deployment/upgrade, calls that require admin permissions (e.g., createProduct, updateLogo, seedProducts) succeed when the caller is principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\".",
        "After deployment/upgrade, the owner principal appears as an admin when checked via the existing admin-check API used by the frontend (React Query hook useIsCallerAdmin).",
        "Admin state is enforced server-side and does not rely on frontend checks."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce single-admin mode in the admin-management APIs: only the owner principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\" can call admin-management endpoints, and add/remove operations must be blocked so no additional admins can be created and the owner cannot be removed/demoted.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-4"
        ],
        "quotes": [
          "should me be the only admin for now",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "backend/main.mo rejects attempts to add any admin principal (including by the owner) with a clear error message indicating single-admin mode is enabled.",
        "backend/main.mo rejects attempts to remove the owner principal as admin (even if such a call is attempted via candid/direct calls).",
        "listAdmins returns exactly one principal: \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\"."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the Admin Access Management UI (/admin/access) to reflect single-admin mode by disabling or removing the “Add New Admin” and “Remove Administrator” actions and showing an English explanation that admin access is locked to the owner principal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-4"
        ],
        "quotes": [
          "should me be the only admin for now",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "On /admin/access, the UI does not allow submitting the add-admin form and does not allow triggering remove-admin for any entry.",
        "The page shows a clear English notice that single-admin mode is enabled and only the owner principal can be an admin.",
        "The current admins list renders and shows exactly one admin entry (the owner principal) when listAdmins returns one principal."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Supporting multiple admins or role escalation flows beyond the single owner principal.",
    "Third-party authentication providers beyond Internet Identity.",
    "Adding real-time updates (WebSockets/push)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}