{
  "kind": "build_request",
  "title": "Web Owner admin dashboard with secure Internet Identity gating and product CRUD (variants, stock, soft delete)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a dedicated Web Owner admin dashboard entry route at \"/owner\" (or make \"/owner\" an alias to the existing \"/admin\" dashboard) and ensure the page title (H1) and document title are \"Web Owner Dashboard\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Route: /owner or /admin",
          "Page Title: \"Web Owner Dashboard\""
        ]
      },
      "acceptanceCriteria": [
        "Visiting #/owner renders the admin dashboard UI (same functionality as the admin dashboard).",
        "The visible page header reads \"Web Owner Dashboard\".",
        "The browser/document title is \"Web Owner Dashboard\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce access control for the Web Owner dashboard and product management pages using Internet Identity authentication and admin verification via the existing useIsCallerAdmin() hook; unauthenticated users must see \"Login Required\" and non-admin users must see \"Access Denied\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Only authenticated admin users can access this page.",
          "Use Internet Identity authentication.",
          "Verify admin using useIsCallerAdmin() hook.",
          "Non-admin users must see \"Access Denied\".",
          "Unauthenticated users must see \"Login Required\"."
        ]
      },
      "acceptanceCriteria": [
        "When not authenticated, the guard UI displays \"Login Required\" (exact text) and provides a login action.",
        "When authenticated but not admin, the guard UI displays \"Access Denied\" (exact text).",
        "Admin-only routes remain inaccessible to non-admin users even if they try to navigate directly (e.g., #/admin/products)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the backend product data model and CRUD to support admin-only product management with the required fields: id, name, category, image (stored as a single primary image string or first element of images), price, discountPrice (optional), variants[] (optional), stock quantity, createdAt, and soft delete.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Management Features (Only Add / Edit / Remove)",
          "Save product to database.",
          "Soft delete preferred",
          "Each product must support: id name category image price discountPrice variants[] stock createdAt"
        ]
      },
      "acceptanceCriteria": [
        "Product records persisted in the canister include stock quantity and a soft-delete flag/state so products can be removed without hard deletion.",
        "All create/update/delete operations remain admin-only (trapping/denying non-admin calls).",
        "Public product listing/query endpoints do not return soft-deleted products.",
        "Discount price is optional and represented consistently in the backend API (e.g., optional field).",
        "Variants are supported for both single-price products (no variants) and variant-based products (variants present)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Implement a conditional Motoko state migration to safely upgrade existing stored products to the new product schema (e.g., initialize stock to a default and deleted to false for existing products) without losing existing data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Soft delete preferred",
          "Stock Quantity"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister does not trap due to missing new product fields.",
        "Existing products are preserved after upgrade and appear in admin and public views.",
        "Migrated products have a sensible default stock value and are not marked deleted."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Revise the admin product management UI to match the requested dashboard/table layout: show product list in a responsive table with columns Image, Product Name, Category, Price, Discount, Stock, Actions (Edit/Delete), and an \"Add Product\" button at the top.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product list in table format",
          "Columns: Image Product Name Category Price Discount Stock Actions (Edit / Delete)",
          "Add Product button on top",
          "Responsive design"
        ]
      },
      "acceptanceCriteria": [
        "Admin products page displays a table (not a card grid) with the specified columns.",
        "Each row includes Edit and Delete actions.",
        "An \"Add Product\" button is visible above the table.",
        "Layout remains usable on mobile (table becomes stacked/scrollable appropriately)."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Implement Add/Edit product workflows using a modal form with validation and loading states, supporting fields: Product Name, Category dropdown (Bee Products, Natural Honey, Raw Honey), JPEG image upload, Price, Discount Price (optional), Stock Quantity, and Variant Options (optional: weight variants 250g/500g/1000g; type variants such as \"MULTIFLORA\" / \"Raw & Unprocessed\" etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use modal for add/edit form",
          "Use form validation",
          "Upload Image (JPEG only)",
          "Variant Options (optional)",
          "Weight variants (250g, 500g, 1000g)",
          "Type variants (MULTIFLORA, Raw & Unprocessed, etc.)"
        ]
      },
      "acceptanceCriteria": [
        "Add/Edit opens in a modal dialog.",
        "Form validation prevents submission when required fields are missing or invalid (e.g., negative price, invalid discount rules, invalid stock).",
        "Image input only accepts JPEG and rejects other types in the UI.",
        "Variant inputs can be left empty for single-price products, and can be provided for weight/type variant products.",
        "Save action shows a loading state and is disabled while the mutation is pending."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Replace product deletion with a confirmation popup and perform a soft delete (preferred) through secure admin-only backend calls; ensure non-admin users cannot modify products and surface errors via toast notifications.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Delete with confirmation popup",
          "Soft delete preferred",
          "Secure API calls",
          "Do NOT allow non-admin modifications",
          "Show success/error toast notifications"
        ]
      },
      "acceptanceCriteria": [
        "Deleting a product requires explicit confirmation in a modal/popup (not window.confirm).",
        "Delete triggers a backend call that marks the product deleted (soft delete).",
        "After deletion, the product disappears from public product listings and from the default admin list.",
        "If a non-admin attempts any product mutation, the backend rejects it and the UI shows an error toast."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add admin product list enhancements (bonus): search by product name/text, filter by category, show total product count, and display a low-stock alert indicator based on a configurable threshold.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Bonus (Optional if possible)",
          "Search products",
          "Filter by category",
          "Show total product count",
          "Show low stock alert"
        ]
      },
      "acceptanceCriteria": [
        "Admin products page includes a search input that filters the currently loaded products.",
        "Admin products page includes a category filter (All + each category).",
        "UI shows total product count for the current filtered result set.",
        "Products with stock at or below the chosen threshold are visually marked as low stock (e.g., badge/row highlight)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit files under frontend/src/components/ui or other paths listed as immutable in SYSTEM_CONTEXT; compose those components instead.",
    "All user-facing text must be in English.",
    "Authentication must use Internet Identity (no third-party auth)."
  ],
  "nonGoals": [
    "Implementing checkout, payments, or order management.",
    "Implementing real-time features (WebSockets/chat/push notifications).",
    "Storing images in an external database or external storage service."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}