{
  "kind": "build_request",
  "title": "Restrict Admin Access management page to a single owner principal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restrict access to the Admin Access management route (/admin/access) so it can only be viewed/used by the owner’s Internet Identity principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\" (self-only access), even if other principals are admins.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-8",
          "recent-10"
        ],
        "quotes": [
          "make it accessed by myself only",
          "1. Do you want me to build the admin‑management page so you can add that principal as an admin ,can be accessed by myself only"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as principal zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe, navigating to /#/admin/access renders the existing AdminAccessPage UI.",
        "When logged in as any other principal, navigating to /#/admin/access shows an explicit Access Denied experience (not the admin management UI), even if that principal would otherwise pass the generic admin check.",
        "When not logged in, /#/admin/access prompts the user to log in with Internet Identity, and after login still enforces the owner-principal restriction."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Enforce the same self-only access control on the backend admin-management APIs used by the Admin Access page (listAdmins, addAdmin, removeAdmin), allowing calls only when caller is the owner principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\".",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-8",
          "recent-10"
        ],
        "quotes": [
          "make it accessed by myself only",
          "1. Do you want me to build the admin‑management page so you can add that principal as an admin ,can be accessed by myself only"
        ]
      },
      "acceptanceCriteria": [
        "Calling listAdmins/addAdmin/removeAdmin as the owner principal succeeds (subject to existing validation like preventing anonymous principals and preventing self-removal).",
        "Calling listAdmins/addAdmin/removeAdmin as any non-owner principal traps/rejects with an unauthorized error.",
        "Other existing backend APIs and admin functionality behavior remains unchanged."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/components/ui and the Internet Identity/actor hooks under frontend/src/hooks/useInternetIdentity.ts(x) and frontend/src/hooks/useActor.ts are immutable and must not be edited.",
    "Keep the backend as a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if a state upgrade is required (not expected for this change unless new stable state is introduced).",
    "All user-facing text must be in English."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers; only Internet Identity is used.",
    "Do not add new admin features beyond restricting access to the existing Admin Access page and its related backend APIs.",
    "Do not redesign unrelated admin routes (/admin, /admin/products, /admin/news, /admin/logo) unless required to implement the self-only restriction for /admin/access."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}