{
  "kind": "build_request",
  "title": "Replace Internet Identity admin auth with fixed username/password login",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend admin credential initialization so that the only valid admin login is username \"Thejas Kinnigoli\" with password \"789852qwertyuiop\" (and the stored/checked value uses the existing password hashing mechanism).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "make login for admin with user name : Thejas Kinnigoli and Password : 789852qwertyuiop, no authenticate with Internet Identity (passkey)."
        ]
      },
      "acceptanceCriteria": [
        "Calling backend.adminLogin(\"Thejas Kinnigoli\", \"789852qwertyuiop\") returns a non-null sessionId.",
        "Calling backend.adminLogin with any other username or password returns null.",
        "The password is not stored or compared as plaintext in backend state; it is compared using the existing hashPassword() flow."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove Internet Identity (passkey) authentication requirements and UI from the admin area so admin access is granted only via the username/password admin session flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "no authenticate with Internet Identity (passkey)."
        ]
      },
      "acceptanceCriteria": [
        "No admin page shows a prompt/button to \"Login with Internet Identity\" or any Internet Identity-based access gating.",
        "Admin routes under /admin/* are accessible only after successful username/password login (via the existing admin session validation).",
        "The /admin/access page is not reachable from the UI (remove it from admin navigation) and is not registered as a route, or it is replaced with an English message explaining it is unavailable because Internet Identity is disabled for admin auth.",
        "All user-facing text related to this change is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend/immutablePaths (including frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui/*).",
    "Keep all Motoko logic in the single actor at backend/main.mo; only add backend/migration.mo if an upgrade-safe state migration is required."
  ],
  "nonGoals": [
    "Do not implement or require Internet Identity authentication for admin access.",
    "Do not add third-party authentication providers.",
    "Do not implement multi-admin management via principals (since Internet Identity is disabled for admin auth)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}