{
  "kind": "build_request",
  "title": "Fix admin dashboard flickering after clicking (layout regression)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Stop the admin UI from flickering after a click by removing conflicting admin-auth gating/redirect logic and ensuring admin navigation (switching sections inside the dashboard) does not trigger redirects or full remount loops.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin page is flickering so i can't access it",
          "only after a click",
          "changed",
          "Layout",
          "fix it",
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "When visiting /admin as an authenticated admin, clicking any sidebar item (Dashboard, Store Settings, Products, Orders, Customers) does not cause visible page flicker or repeated full-screen loading states.",
        "When visiting /admin while not authenticated, the app redirects to /admin/login once (no redirect loop) and remains stable.",
        "After successful admin login, navigation to /admin is stable and does not flicker when interacting with the dashboard layout (sidebar clicks, mobile menu open/close).",
        "Admin session validation/loading UI appears only when genuinely validating (e.g., initial page load) and does not re-trigger on simple UI clicks that only change local layout state."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a small, developer-facing diagnostic safeguard to prevent repeated navigations in admin routing (e.g., avoid calling navigate to the same path repeatedly) and ensure admin routing guards do not create rapid state oscillation between authenticated/unauthenticated during normal interaction.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "admin page is flickering so i can't access it",
          "only after a click",
          "changed",
          "Layout"
        ]
      },
      "acceptanceCriteria": [
        "AdminRouteGuard does not invoke navigation repeatedly when already on the target route.",
        "In React DevTools/console, interacting with the admin sidebar does not cause rapid alternating renders between the dashboard and blank/null states.",
        "If the user is unauthenticated, admin pages render either a stable redirect to /admin/login or a stable login UI, without intermittent dashboard flashes."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui (compose these components instead).",
    "Keep the backend as a single Motoko actor; no new backend services."
  ],
  "nonGoals": [
    "Implementing a new admin authentication backend (secure username/password hashing, sessions, etc.).",
    "Redesigning the admin dashboard UI beyond what is required to eliminate the flicker regression.",
    "Changing public-site pages, routing, or theme unrelated to the admin flicker."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}