{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin dashboard flicker by stabilizing admin auth guards and navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Eliminate conflicting admin auth gating and stabilize admin dashboard layout interactions so local UI state changes (sidebar clicks/mobile menu) don’t trigger redirects or remount/loading loops.",
      "acceptanceCriteria": [
        "When visiting /admin as an authenticated admin, clicking any sidebar item (Dashboard, Store Settings, Products, Orders, Customers) does not cause visible page flicker or repeated full-screen loading states.",
        "When visiting /admin while not authenticated, the app redirects to /admin/login once (no redirect loop) and remains stable.",
        "After successful admin login, navigation to /admin is stable and does not flicker when interacting with the dashboard layout (sidebar clicks, mobile menu open/close).",
        "Admin session validation/loading UI appears only when genuinely validating (e.g., initial page load) and does not re-trigger on simple UI clicks that only change local layout state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Remove the nested AdminAccessGate from the admin dashboard page so /admin is guarded in exactly one place (AdminRouteGuard). Keep section switching purely local (no auth checks/redirects triggered by section state)."
        },
        {
          "path": "frontend/src/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Stop session validation state from oscillating during normal UI interactions by making validation a one-time (or sessionId-change) check sourced from localStorage/expiry, instead of coupling isValidating to actor/isFetching changes. Ensure isValidating only reflects genuine session initialization/rehydration."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Adjust guard rendering to avoid null flashes and unnecessary full-screen loaders: show the validating UI only during initial validation, and otherwise render children for authenticated users. Use the new safe-navigation utility to perform a single stable redirect to /admin/login for unauthenticated users."
        },
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Harden login page redirect behavior to avoid redundant navigations: after successful login, navigate to /admin only once and avoid re-navigating if already there (via safe-navigation helper)."
        },
        {
          "path": "frontend/src/components/admin/AdminAccessGate.tsx",
          "operation": "modify",
          "description": "Deprecate this component to prevent future reintroduction of conflicting gating: add a clear comment indicating it should not be used alongside AdminRouteGuard, and (optionally) simplify it to a thin wrapper or leave it unused without affecting runtime behavior."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a developer-facing safeguard in admin routing to prevent repeated navigations to the same path and reduce auth-state oscillation that can cause flicker.",
      "acceptanceCriteria": [
        "AdminRouteGuard does not invoke navigation repeatedly when already on the target route.",
        "In React DevTools/console, interacting with the admin sidebar does not cause rapid alternating renders between the dashboard and blank/null states.",
        "If the user is unauthenticated, admin pages render either a stable redirect to /admin/login or a stable login UI, without intermittent dashboard flashes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/safeNavigate.ts",
          "operation": "create",
          "description": "Create a small helper for TanStack Router navigation that no-ops when the app is already at the target path and logs a developer-facing warning if repeated same-path navigations are attempted in rapid succession (diagnostic safeguard)."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Use safeNavigate helper to avoid calling navigate to the same route repeatedly and to guard against rapid state oscillation; ensure redirects use a stable single-shot behavior (e.g., replace) when redirecting to /admin/login."
        },
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "Use safeNavigate helper for the authenticated redirect (/admin) and for post-login navigation, preventing repeated navigations when already on /admin."
        }
      ]
    }
  ]
}