{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Web Owner dashboard alias, II admin guard text compliance, and revised admin product table + modal CRUD UX",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add /owner admin dashboard route (alias to existing dashboard) and set H1 + document title to \"Web Owner Dashboard\".",
      "acceptanceCriteria": [
        "Visiting #/owner renders the admin dashboard UI (same functionality as the admin dashboard).",
        "The visible page header reads \"Web Owner Dashboard\".",
        "The browser/document title is \"Web Owner Dashboard\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new hash route at \"/owner\" that renders the same guarded dashboard content as \"/admin\" (alias), ensuring navigation is not orphaned."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Update the dashboard H1 and usePageMeta title to \"Web Owner Dashboard\" so both the visible header and document title match the requirement."
        },
        {
          "path": "frontend/src/hooks/usePageMeta.ts",
          "operation": "modify",
          "description": "Adjust document-title behavior so the resulting document title is exactly \"Web Owner Dashboard\" when requested (i.e., avoid appending a suffix for this page)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enforce Internet Identity + admin verification gating for owner/admin routes, with exact guard messages \"Login Required\" and \"Access Denied\".",
      "acceptanceCriteria": [
        "When not authenticated, the guard UI displays \"Login Required\" (exact text) and provides a login action.",
        "When authenticated but not admin, the guard UI displays \"Access Denied\" (exact text).",
        "Admin-only routes remain inaccessible to non-admin users even if they try to navigate directly (e.g., #/admin/products)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Update the guard UI strings to match exact required text (\"Login Required\" and \"Access Denied\"), keep the login action using the Internet Identity flow via the authorization component’s frontend pattern (useInternetIdentity + useIsCallerAdmin). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the \"/owner\" alias and all admin product management routes remain wrapped in AdminRouteGuard so direct navigation stays protected."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Revise the admin products page to a responsive table with specified columns and an Add Product button above the table.",
      "acceptanceCriteria": [
        "Admin products page displays a table (not a card grid) with the specified columns.",
        "Each row includes Edit and Delete actions.",
        "An \"Add Product\" button is visible above the table.",
        "Layout remains usable on mobile (table becomes stacked/scrollable appropriately)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Replace the card grid with a responsive table layout that includes columns: Image, Product Name, Category, Price, Discount, Stock, Actions (Edit/Delete), and keep the Add Product button above the table; use existing shadcn-ui primitives already in the project where appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Add minimal global utility styling (if needed) to support mobile table responsiveness (e.g., horizontal scroll container or stacked row labels) without introducing new global stylesheet paths."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Implement Add/Edit product modal form with validation and loading states, supporting category dropdown, JPEG upload, pricing/discount, stock, and optional variants (weight/type).",
      "acceptanceCriteria": [
        "Add/Edit opens in a modal dialog.",
        "Form validation prevents submission when required fields are missing or invalid (e.g., negative price, invalid discount rules, invalid stock).",
        "Image input only accepts JPEG and rejects other types in the UI.",
        "Variant inputs can be left empty for single-price products, and can be provided for weight/type variant products.",
        "Save action shows a loading state and is disabled while the mutation is pending."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Refactor the modal form fields to match the requested workflow: Product Name, Category dropdown (Bee Products/Natural Honey/Raw Honey), JPEG-only file input that converts to a safe string representation for the product primary image, Price + optional Discount Price, Stock Quantity, and optional Variant Options (weight 250g/500g/1000g and type variants). Implement client-side validation and disable/indicate loading during save using existing shadcn-ui Dialog/form inputs. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update product mutations to align with the current backendInterface typing: pass a single primary image string (not an images array) and include stock and optional variants in create/update calls; keep react-query invalidation behavior consistent."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Replace delete with a confirmation popup (not window.confirm), perform soft delete via backend calls, and show mutation errors via toast notifications.",
      "acceptanceCriteria": [
        "Deleting a product requires explicit confirmation in a modal/popup (not window.confirm).",
        "Delete triggers a backend call that marks the product deleted (soft delete).",
        "After deletion, the product disappears from public product listings and from the default admin list.",
        "If a non-admin attempts any product mutation, the backend rejects it and the UI shows an error toast."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Replace window.confirm with a shadcn-ui modal/popup confirmation (e.g., AlertDialog) before calling the delete mutation; keep success/error toast notifications (sonner) and ensure backend-rejection errors surface as error toasts. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Ensure guard behavior and messaging remain consistent so non-admin users cannot access product management pages to initiate mutations (defense-in-depth alongside backend enforcement)."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Add admin product list enhancements: search, category filter, total count display, and low-stock indicator with configurable threshold.",
      "acceptanceCriteria": [
        "Admin products page includes a search input that filters the currently loaded products.",
        "Admin products page includes a category filter (All + each category).",
        "UI shows total product count for the current filtered result set.",
        "Products with stock at or below the chosen threshold are visually marked as low stock (e.g., badge/row highlight)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/AdminProductsPage.tsx",
          "operation": "modify",
          "description": "Add client-side search (by product name/text), category filter (All + each category), a visible total count for the filtered results, and a configurable low-stock threshold control; visually mark low-stock rows/badges in the table using existing brand/shadcn-ui primitives. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}