{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Owner-only access restriction for Admin Access route",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Restrict /admin/access to the single owner Internet Identity principal with a login-required flow and explicit Access Denied UI for all others (including admins).",
      "acceptanceCriteria": [
        "When logged in as principal zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe, navigating to /#/admin/access renders the existing AdminAccessPage UI.",
        "When logged in as any other principal, navigating to /#/admin/access shows an explicit Access Denied experience (not the admin management UI), even if that principal would otherwise pass the generic admin check.",
        "When not logged in, /#/admin/access prompts the user to log in with Internet Identity, and after login still enforces the owner-principal restriction."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config/owner.ts",
          "operation": "create",
          "description": "Add a single source of truth for the owner principal string (zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe) and a small helper to compare the current authenticated principal string to the owner. Verify the component's usage instructions before implementing (authorization: frontend auth/access-control guidance)."
        },
        {
          "path": "frontend/src/components/admin/OwnerOnlyRouteGuard.tsx",
          "operation": "create",
          "description": "Create an owner-only route guard for /admin/access that uses the immutable useInternetIdentity hook to (1) prompt login when not authenticated, (2) show an explicit Access Denied screen when authenticated but not the owner principal, and (3) render children only for the owner principal. Ensure all user-facing text is English. Verify the component's usage instructions before implementing (authorization: show AccessDeniedScreen for unauthorized users; handle auth state correctly)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new OwnerOnlyRouteGuard into routing by wrapping the existing /admin/access route with it (replacing the current AdminRouteGuard wrapper for this route only). Keep all other admin routes unchanged. Verify the component's usage instructions before implementing (authorization: frontend auth/access-control guidance)."
        },
        {
          "path": "frontend/src/pages/admin/AdminDashboardPage.tsx",
          "operation": "modify",
          "description": "Use the immutable useInternetIdentity hook plus the shared owner principal helper to hide/disable the 'Admin Access' navigation card for non-owner admins (optional UX hardening), while leaving the route enforcement to the guard. Keep all text in English. Verify the component's usage instructions before implementing (authorization: access-control UI guidance)."
        }
      ]
    }
  ]
}