{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Project to deploy an application with an admin page and role-based access, initially granting sole admin rights to the user’s Internet Identity principal.",
  "architectural_notes": [
    "Use an admin allowlist keyed by Internet Identity principal; initially operate in single-admin mode (only one principal has admin rights)."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-update-the-admin-access-management-ui-admin-access-to-reflect-single-admin-mode-by-disabling-or-removing-the-add-new-admin-and-remove-administrator-actions-and-showing-an-english-explanation-that-admin-access-is-locked-to-the-owner-principal",
      "title": "Update the Admin Access Management UI (/admin/access) to reflect single-admin mode by disabling or removing the “Add New Admin” and “Remove Administrator” actions and showing an English explanation that admin access is locked to the owner principal.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Implement admin access control: make the provided Internet Identity principal the sole admin (single-admin mode) and enforce permissions on the admin page.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Grant admin privileges to the Internet Identity principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\" and ensure it remains the only administrator (single-admin mode).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Enforce single-admin mode in the admin-management APIs: only the owner principal \"zq4an-uqz34-isqap-u5moy-4rxll-vz3ff-ndqph-gvmn5-hqe6u-o6j3v-yqe\" can call admin-management endpoints, and add/remove operations must be blocked so no additional admins can be created and the owner cannot be removed/demoted.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Make provided principal the sole admin (single-admin mode)",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}